package Course1.Task10;
/*10. Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.*/
public class Task10 {
    public static void main(String[] args) {
        int a = 1;
        int b = 2;
        int c = a + b;
        System.out.println(c);
    }
}
