package hw_book_good_student.domain;

public interface TitleLists {

    //The array holds a list of book titles to generate objects
    String[] TITLELIST = {
            "Война и мир",
            "1984",
            "Улисс",
            "Шум и ярость",
            "Лолита",
            "Человек-невидимка",
            "На маяк",
            "Гордость и предубеждение",
            "Божественная комедия",
            "Кентерберийские рассказы",
            "Путешествия Гулливера",
            "Миддлмарч",
            "И пришло разрушение",
            "Над пропастью во ржи",
            "Унесенные ветром",
            "Сто лет одиночества",
            "Великий Гэтсби",
            "Уловка-22",
            "Возлюбленная",
            "Гроздья гнева"
    };

    String[] NAMEAUTHOR = {
            "Лев",
            "Джордж",
            "Джеймс",
            "Владимир",
            "Уильям",
            "Ральф",
            "Вирджиния",
            "Гомер",
            "Джейн",
            "Данте",

    };
}