package hw_book_good_student.domain;

public interface TitleLists {

    //The array holds a list of book titles to generate objects
    String[] TITLELIST = {
            "Война и мир",
            "1984",
            "Улисс",
            "Лолита",
            "Шум и ярость",
            "Человек-невидимка",
            "На маяк",
            "Илиада и Одиссея",
            "Гордость и предубеждение",
            "Божественная комедия",
            "Кентерберийские рассказы",
            "Путешествия Гулливера",
            "Миддлмарч",
            "И пришло разрушение",
            "Над пропастью во ржи",
            "Унесенные ветром",
            "Сто лет одиночества",
            "Великий Гэтсби",
            "Уловка-22",
            "Возлюбленная",
    };

    String[] NAMEAUTHORLIST = {
            "Лев",
            "Джордж",
            "Джеймс",
            "Владимир",
            "Уильям",
            "Ральф",
            "Вирджиния",
            "Гомер",
            "Джейн",
            "Данте",
            "Джеффри",
            "Джонатан",
            "Джордж",
            "Чинуа",
            "Джером",
            "Маргарет",
            "Габриель",
            "Френсис",
            "Джозеф",
            "Тони"
    };

    String[] SURNAMEAUTHORLIST = {
            "Толстой",
            "Оруэлл",
            "Джойс",
            "Набоков",
            "Фолкнер",
            "Эллисон",
            "Вульф",
            "null",
            "Остен",
            "Алигьери",
            "Чосер",
            "Свифт",
            "Элиот",
            "Ачебе",
            "Сэлинджер",
            "Митчелл",
            "Гарсия",
            "Скотт",
            "Хеллер",
            "Моррисон"
    };

    String[] PATRONYMICAUTHORLIST = {
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "null",
            "Маркес",
            "Фицджеральд",
            "null",
            "null"
    };
}