package HW_Book_Good_Student;

interface TitleList {

    String[] TITLELIST = {
            "Война и мир",
            "1984",
            "Улисс",
            "Шум и ярость",
            "Лолита",
            "Человек-невидимка",
            "На маяк",
            "Гордость и предубеждение",
            "Божественная комедия",
            "Кентерберийские рассказы",
            "Путешествия Гулливера",
            "Миддлмарч",
            "И пришло разрушение",
            "Над пропастью во ржи",
            "Унесенные ветром",
            "Сто лет одиночества",
            "Великий Гэтсби",
            "Уловка-22",
            "Возлюбленная",
            "Гроздья гнева"
    };


}