package Course1.Task6;
/*6. Вывести на  экран все четные цифры от 1 до 100 не используя
 остаток от деления (используя только цикл for)*/

public class Task6 {
    public static void main(String[] args) {
        for (int i = 0; i < 101; i++) {
            System.out.println(i);
            i++;
            }
    }
}
